import React from 'react';
import styles from './About.module.css';

// class About extends React.Component<any> {
const About: React.FC<any> = () => {

  let text1 = "    “Veggyline” - една различна гледна точка за това как, без да изпадаме в крайности, можем да бъдем едновременно здрави, "
  + "красиви и отговорни към заобикалящата ни среда. Следвайки тази линия на живота можем да изгадим здраво, красиво и хармонично тяло "
  + "далеч по-ефективно отколкото можем да си представим. Приддържайки се към тази идея хората, работещи със себе си и загрижени към заобикалящата"
  + " ги среда, могат да се замислят за посоката, по която са поели.\n"
  + "    Основната цел е информиране за това как да изградим красиво и здраво тяло изцяло на растително хранене (plant-based diet), "
  + "как да имаме здрав дух в здраво тяло, същевременно грижейки се за нещо много по-мащабно от нашето тяло. Тук се разглеждат и други теми, "
  + "свързани с природосъобразния начин на живот и спорт."

  // let text2 = "  Основната цел е информиране за това как да изградим красиво и здраво тяло изцяло на растително хранене (plant-based diet), "
  // + "как да имаме здрав дух в здраво тяло, същевременно грижейки се за нещо много по-мащабно от нашето тяло. Тук се разглеждат и други теми, "
  // + "свързани с природосъобразния начин на живот и спорт.";
  // let text3 = 'Страницата е предназначена както за хора, които са избрали този начин на живот, така и за такива, които имат желание да научат повече по темата. '
  // + 'Живеейки в свят, основан на разделението, където изобилства крайно противоречива информация за почти всичко, '
  // + 'нека бъдем толерантни и приемаме различните гледни точки!';
  // + 'нека бъдем толерантни и  U+1F603 приемаме различните гледни точки! \uD83D\uDE00';

  return (
        <div className={styles.About}>
          <img src={require('../../../../images/image_about.jpg')} alt=""/>
          <pre className={styles.textAbout}>{text1}</pre>
          {/* <p>{text2}</p> */}

          {/* <div className={styles.scrollDown} onClick={(e) => gotoBottom(e.target)}>{'▼'}</div> */}
        </div>
  )

  function gotoBottom(element: any){
    element.parentElement.scrollTop = element.parentElement.scrollHeight - element.parentElement.clientHeight;
  }
}

export default About;
