import React from 'react';
import styles from './AboutMobile.module.css';

const AboutMobile: React.FC<any> = () => {
  let text1 = "    “Veggyline” - една различна гледна точка за това как, без да изпадаме в крайности, можем да бъдем едновременно здрави, "
  + "красиви и отговорни към заобикалящата ни среда. Следвайки тази линия на живота можем да изгадим здраво, красиво и хармонично тяло "
  + "далеч по-ефективно отколкото можем да си представим. Приддържайки се към тази идея хората, работещи със себе си и загрижени към заобикалящата"
  + " ги среда, могат да се замислят за посоката, по която са поели.\n"
  + "    Основната цел е информиране за това как да изградим красиво и здраво тяло изцяло на растително хранене (plant-based diet), "
  + "как да имаме здрав дух в здраво тяло, същевременно грижейки се за нещо много по-мащабно от нашето тяло. Тук се разглеждат и други теми, "
  + "свързани с природосъобразния начин на живот и спорт."

  return (
    <div className={styles.AboutMobile}>
      <img src={require('../../../../images/image_about.jpg')} alt=""/>
      <pre className={styles.textAbout}>{text1}</pre>
      {/* <p>{text1}</p>
      <p>{text2}</p>
      <p>{text3}</p> */}
    </div>
  )

};

export default AboutMobile;
