import React from 'react';
import styles from './AboutMobile.module.css';

const AboutMobile: React.FC<any> = () => {
  let text1 = "Страница, която ще ни накара да се замислим за линията, която следваме в живота си и начинът, по който гледаме на нещата.";
  let text2 = 'Основната цел е информиране за това как да изградим красиво и здраво тяло изцяло на растително хранене (plant-based diet),'
  + 'как да бъдем в перфектна форма и здраве, същевременно грижейки се за нещо много по-мащабно от нашето тяло.'
  + 'Тук се разглеждат и други теми, свързани с природосъобразния начин на живот и спорт.';
  let text3 = 'Страницата е предназначена както за хора, които са избрали този начин на живот, така и за такива, които имат желание да научат повече по темата.'
  + 'Живеейки в свят, основан на разделението, където изобилства крайно противоречива информация за почти всичко,'
  + 'нека бъдем толерантни и приемаме различните гледни точки!';

  return (
    <div className={styles.AboutMobile}>
      <img src={require('../../../../images/image_about.jpg')} alt=""/>
      <p>{text1}</p>
      <p>{text2}</p>
      <p>{text3}</p>
    </div>
  )

};

export default AboutMobile;
